Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: wherein the control module includes a coded bitstring correlation map (300) and is configured to operate the state modules as dictated by the coded bitstring correlation map;
de_de: wobei das Steuermodul eine codierte Bitfolgen-Korrelationskarte (300) aufweist und dazu konfiguriert ist, die Zustandsmodule wie durch die codierte Bitfolgen-Korrelationskarte vorgegeben zu betreiben;

source: characterized in that
de_de: dadurch gekennzeichnet, dass

source: the coded bitstring (109) includes a plurality of discrete bits less than the amount of state modules (105a-p), wherein a plurality of the state modules (105a-p) are correlated, based on the correlation map, with at least one discrete bit of the plurality of discrete bits such that the coded bitstring (109) is correlated, based on the correlation map, to a predetermined plurality of on states or off states for the plurality of the state modules (105a-p).
de_de: die codierte Bitfolge (109) eine Vielzahl diskreter Bits aufweist, die kleiner ist als die Menge der Zustandsmodule (105a-p), wobei eine Vielzahl der Zustandsmodule (105a-p) basierend auf der Korrelationskarte mit mindestens einem diskreten Bit der Vielzahl diskreter Bits derart korreliert ist, dass die codierte Bitfolge (109) basierend auf der Korrelationskarte mit einer vorbestimmten Vielzahl von Ein-Zuständen oder Aus-Zuständen für die Vielzahl der Zustandsmodule (105a-p) korreliert ist.

source: 2. A sensor system (100), comprising: a sensor configured to output raw sensor data; and the signal processing system of claim 1.
de_de: 2. Sensorsystem (100), umfassend: einen Sensor, der zum Ausgeben von Sensorrohdaten konfiguriert ist, und das Signalverarbeitungssystem nach Anspruch 1.

source: 3. The system of any preceding claim, wherein each discrete bit is configured to include a 1 or a 0 such that each coded bitstring (109) is a bitstring consisting of 1s and/or 0s.
de_de: 3. System nach einem der vorhergehenden Ansprüche, wobei jedes diskrete Bit dazu konfiguriert ist, eine 1 oder eine 0 derart aufzuweisen, dass jede codierte Bitfolge (109) eine aus Einsen und/oder Nullen bestehende Bitfolge ist.

source: 4. The system of any preceding claim, wherein the plurality of state modules (105a-p) are configured to be turned on for an associated bitstring, and wherein a remainder of state modules (105a-p) are configured to be turned off for the associated bitstring.
de_de: 4. System nach einem der vorhergehenden Ansprüche, wobei die Vielzahl von Zustandsmodulen (105a-p) dazu konfiguriert ist, für eine zugehörige Bitfolge eingeschaltet zu werden, und wobei die übrigen Zustandsmodule (105a-p) dazu konfiguriert sind, für die zugehörige Bitfolge ausgeschaltet zu werden.

source: 5. The system of any preceding claim, wherein the plurality of state modules (105a-p) are configured to be turned on when an associated bit of the plurality of discrete bits is a 1, and wherein the plurality of state modules (105a-p) are configured to be turned off when the associated bit is 0.
de_de: 5. System nach einem der vorhergehenden Ansprüche, wobei die Vielzahl von Zustandsmodulen (105a-p) dazu konfiguriert ist, eingeschaltet zu werden, wenn ein zugehöriges Bit der Vielzahl von diskreten Bits eine 1 ist, und wobei die Vielzahl von Zustandsmodulen (105a-p) dazu konfiguriert ist, ausgeschaltet zu werden, wenn das zugehörige Bit 0 ist.

source: 6. The system of any preceding claim, wherein the system comprises a plurality of logic gates, and wherein each state module (105a-p) is connected to an input of a respective processing module (103a-p) and an input of a respective logic gate, wherein an output of the respective processing module (103a-p) is connected to the input of the logic gate, wherein the state module (105a-p) is configured to either output to the respective processing module (103a-p) or the logic gate to bypass the respective processing module (103a-p), wherein the respective logic gate is configured to output only data from one of a respective state module (105a-p) or a respective processing module (103a-p).
de_de: 6. System nach einem der vorhergehenden Ansprüche, wobei das System eine Vielzahl von Logikgattern umfasst, und wobei jedes Zustandsmodul (105a-p) mit einem Eingang eines jeweiligen Verarbeitungsmoduls (103a-p) und einem Eingang eines jeweiligen Logikgatters verbunden ist, wobei ein Ausgang des jeweiligen Verarbeitungsmoduls (103a-p) mit dem Eingang des Logikgatters verbunden ist, wobei das Zustandsmodul (105a-p) dazu konfiguriert ist, entweder an das jeweilige Verarbeitungsmodul (103a-p) oder an das Logikgatter auszugeben, um das jeweilige Verarbeitungsmodul (103a-p) zu umgehen, wobei das jeweilige Logikgatter dazu konfiguriert ist, nur Daten von einem der jeweiligen Zustandsmodule (105a-p) oder einem der jeweiligen Verarbeitungsmodule (103a-p) auszugeben.

source: 7. The system of claim 6, further including a first state module (105a) configured to receive raw sensor data from the sensor (101) or a first logic gate connected to the sensor (101).
de_de: 7. System nach Anspruch 6, das ferner ein erstes Zustandsmodul (105a) aufweist, dazu konfiguriert, rohe Sensordaten von dem Sensor (101) oder einem ersten Logikgatter, das mit dem Sensor (101) verbunden ist, zu empfangen.

source: 8. The system of claim 7, further including a last state module (105p) or last logic gate configured to output processed data from the system.
de_de: 8. System nach Anspruch 7, das ferner ein letztes Zustandsmodul (105p) oder ein letztes Logikgatter aufweist, dazu konfiguriert, verarbeitete Daten aus dem System auszugeben.

source: 9. The system of claim 7 or 8, wherein each state module (105b-p) after the first state module (105a) is connected to a respective logic gate to receive an input from the respective logic gate.
de_de: 9. System nach Anspruch 7 oder 8, wobei jedes Zustandsmodul (105b-p) nach dem ersten Zustandsmodul (105a) mit einem jeweiligen Logikgatter verbunden ist, um eine Eingabe von dem jeweiligen Logikgatter zu empfangen.

source: The system of any preceding claim, wherein the sensor (101) is a data probe for an aircraft.
de_de: System nach einem der vorhergehenden Ansprüche, wobei der Sensor (101) eine Datensonde für ein Flugzeug ist.

source: The system of claim 10, wherein the data probe includes an accelerometer.
de_de: System nach Anspruch 10, wobei die Datensonde einen Beschleunigungsmesser aufweist.

source: The system of any preceding claim, wherein each state module (105a-p) is connected to an input of a respective processing module (103a-p) and an input of a respective OR block, wherein an output of the respective processing module (103a-p) is connected to the input of the logic gate, wherein the state module (105a-p) is configured to either output to the respective processing module (103a-p) or the logic gate to bypass the respective processing module (103a-p), wherein the respective logic gate is configured to output only data from one of a respective state module (105a-p) or a respective processing module (103a-p).
de_de: System nach einem der vorhergehenden Ansprüche, wobei jedes Zustandsmodul (105a-p) mit einem Eingang eines jeweiligen Verarbeitungsmoduls (103a-p) und einem Eingang eines jeweiligen OR-Blocks verbunden ist, wobei ein Ausgang des jeweiligen Verarbeitungsmoduls (103a-p) mit dem Eingang des Logikgatters verbunden ist, wobei das Zustandsmodul (105a-p) dazu konfiguriert ist, entweder an das jeweilige Verarbeitungsmodul (103a-p) oder an das Logikgatter auszugeben, um das jeweilige Verarbeitungsmodul (103a-p) zu umgehen, wobei das jeweilige Logikgatter dazu konfiguriert ist, nur Daten von einem der jeweiligen Zustandsmodule (105a-p) oder einem der jeweiligen Verarbeitungsmodule (103a-p) auszugeben.

source: A method for signal processing, comprising:
de_de: Verfahren zur Signalverarbeitung, umfassend:

source: creating a coded bitstring (109) having a plurality of discrete bits, each discrete bit or the plurality of discrete bits associated with a plurality of processing modules (103a-p) and a plurality of state modules;
de_de: Erzeugen einer codierten Bitfolge (109) mit einer Vielzahl diskreter Bits, wobei jedes diskrete Bit oder die Vielzahl diskreter Bits einer Vielzahl von Verarbeitungsmodulen (103a-p) und einer Vielzahl von Zustandsmodulen zugeordnet ist;

source: wherein each state module is operative to cause a respective processing module to receive and process sensor data;
de_de: wobei jedes Zustandsmodul dazu dient, ein jeweiliges Verarbeitungsmodul zu veranlassen, Sensordaten zu empfangen und zu verarbeiten;

source: sending the coded bitstring (109) to a control module (107) to control which processing modules (103a-p) process sensor data and/or to control the order in which the processing modules process the sensor data;
de_de: Senden der codierten Bitfolge (109) an ein Steuermodul (107), um zu steuern, welche Verarbeitungsmodule (103a-p) Sensordaten verarbeiten und/oder um die Reihenfolge zu steuern, in der die Verarbeitungsmodule die Sensordaten verarbeiten;

source: wherein the control module includes a coded bitstring correlation map (300);
de_de: wobei das Steuermodul eine codierte Bitfolgen-Korrelationskarte (300) aufweist;

source: selecting processing modules (103a-p) and/or an order thereof to process sensor data using the control module (107) based on the coded bitstring (109), by activating or deactivating a predefined set of state modules based on the coded bitstring and as dictated by the coded bitstring correlation map; and
de_de: Auswählen von Verarbeitungsmodulen (103a-p) und/oder einer Reihenfolge davon zum Verarbeiten von Sensordaten unter Verwendung des Steuermoduls (107) basierend auf der codierten Bitfolge (109) durch Aktivieren oder Deaktivieren eines vordefinierten Satzes von Zustandsmodulen basierend auf der codierten Bitfolge und wie durch die Korrelationskarte der codierten Bitfolge vorgegeben; und

source: processing sensor data using the processing modules (103a-p) in accordance with the coded bitstring (109) to output processed data;
de_de: Verarbeiten von Sensordaten unter Verwendung der Verarbeitungsmodule (103a-p) gemäß der codierten Bitfolge (109), um verarbeitete Daten auszugeben.

source: the coded bitstring (109) includes a plurality of discrete bits less than the amount of state modules (105a-p), wherein a plurality of state modules (105a-p) are correlated, based on the coded bitstring correlation map, with at least one discrete bit of the plurality of discrete bits such that the coded bitstring (109) is correlated, based on the coded bitstring correlation map, to a predetermined plurality of on states or off states for the plurality of the state modules (105a-p).
de_de: die codierte Bitfolge (109) eine Vielzahl diskreter Bits aufweist, die kleiner ist als die Menge von Zustandsmodulen (105a-p), wobei eine Vielzahl von Zustandsmodulen (105a-p) basierend auf der codierten Bitfolgen-Korrelationskarte mit mindestens einem diskreten Bit der Vielzahl diskreter Bits derart korreliert ist, dass die codierte Bitfolge (109) basierend auf der codierten Bitfolgen-Korrelationskarte mit einer vorbestimmten Vielzahl von Ein-Zuständen oder Aus-Zuständen für die Vielzahl der Zustandsmodule (105a-p) korreliert ist.

source: The method of claim 13, wherein creating the coded bitstring (109) comprises assigning a 1 or a 0 to each discrete bit, wherein selecting processing modules (103a-p) includes using a plurality of respective processing modules (103a-p) when an associated bit is a 1, and not using a plurality of respective processing modules (103a-p) when an associated bit is a 0.
de_de: Verfahren gemäß Anspruch 13, wobei das Erstellen der codierten Bitfolge (109) das Zuweisen einer 1 oder einer 0 zu jedem diskreten Bit umfasst, wobei das Auswählen der Verarbeitungsmodule (103a-p) das Verwenden einer Vielzahl von jeweiligen Verarbeitungsmodulen (103a-p) einschließt, wenn ein zugehöriges Bit eine 1 ist, und das Nichtverwenden einer Vielzahl von jeweiligen Verarbeitungsmodulen (103a-p), wenn ein zugehöriges Bit eine 0 ist.

source: 1. A fastener dispenser tool (100, 400), comprising:
de_de: 1. Befestigungsmittelspenderwerkzeug (100, 400), umfassend:

source: a retention section (144, 444);
de_de: einen Haltebereich (144, 444);

source: a presentation section (146, 446) extending from the retention section;
de_de: einen Präsentationsbereich (146, 446), der sich vom Haltebereich aus erstreckt;

source: a retention slot (148, 248, 448) extending along the retention section and the presentation section, the retention slot operable to retain a plurality of fasteners (106, 206, 406);
de_de: einen Halteschlitz (148, 248, 448), der sich entlang des Haltebereichs und des Präsentationsbereichs erstreckt, wobei der Halteschlitz betreibbar ist, um eine Vielzahl von Befestigungsmitteln (106, 206, 406) festzuhalten;

source: a presentation slot (112, 212, 412) extending along the presentation section and at least part way into the retention section and in fluid communication with the retention slot, the presentation slot sized to receive a tool bit (114) engageable with a lead fastener (106a, 406a) of the plurality of fasteners;
de_de: einen Präsentationsschlitz (112, 212, 412), der sich entlang des Präsentationsbereichs und mindestens teilweise in den Haltebereich hinein erstreckt und in Fluidverbindung mit dem Halteschlitz steht, wobei der Präsentationsschlitz bemessen ist, um ein Werkzeugstück (114) aufzunehmen, das mit einem Hauptbefestigungsmittel (106a, 406a) der Vielzahl von Befestigungsmitteln verbindbar ist;

source: a fastener ejection portion (405) that extends outwardly from the presentation section for supporting and ejecting the lead fastener (406a) orthogonally, the fastener ejection portion comprising first and second side walls (409a, 409b) that define an ejection opening (407) in fluid communication with the retention slot, the first and second side walls operable to grip and position the lead fastener while being threadably engaged to a structure;
de_de: einen Befestigungsmittel-Auswurfabschnitt (405), der sich vom Präsentationsbereich nach außen erstreckt, um das Hauptbefestigungselement (406a) orthogonal zu stützen und auszuwerfen, wobei der Befestigungsmittel-Auswurfabschnitt eine erste und eine zweite Seitenwand (409a, 409b) umfasst, die eine Auswurföffnung (407) in Fluidverbindung mit dem Halteschlitz definieren, wobei die erste und die zweite Seitenwand betreibbar sind, um das Hauptbefestigungsmittel zu greifen und zu positionieren, während es schraubbar mit einer Struktur verbunden wird;

source: wherein the retention slot and presentation slot are configured, such that the plurality of fasteners are slidable through the retention slot along the presentation section to facilitate dispensing of the lead fastener from the presentation section.
de_de: wobei der Halteschlitz und der Präsentationsschlitz derart konfiguriert sind, dass die Vielzahl von Befestigungsmitteln durch den Halteschlitz entlang des Präsentationsbereichs schiebbar sind, um die Ausgabe des Hauptbefestigungsmittels aus dem Präsentationsbereich zu erleichtern.

source: 2. The fastener dispenser tool of claim 1, further comprising first and second retention devices (156, 157) supported by the retention section for retaining the plurality of fasteners.
de_de: 2. Befestigungsmittelspenderwerkzeug nach Anspruch 1, das ferner eine erste und eine zweite Haltevorrichtung (156, 157) umfasst, die von dem Haltebereich gestützt werden, um die Vielzahl von Befestigungsmitteln festzuhalten.

source: 3. The fastener dispenser tool of claim 1, wherein the retention slot defines a first longitudinal axis, and wherein the presentation slot defines a second longitudinal axis that extends transverse the first longitudinal axis.
de_de: 3. Befestigungsmittelspenderwerkzeug nach Anspruch 1, wobei der Halteschlitz eine erste Längsachse definiert und wobei der Präsentationsschlitz eine zweite Längsachse definiert, die sich quer zu der ersten Längsachse erstreckt.

source: 4. The fastener dispenser tool of claim 1, wherein a portion of the retention slot extends in substantially the same direction as a portion of the presentation slot.
de_de: 4. Befestigungsmittelspenderwerkzeug nach Anspruch 1, wobei sich ein Abschnitt des Halteschlitzes im Wesentlichen in die gleiche Richtung erstreckt wie ein Abschnitt des Präsentationsschlitzes.

source: 5. The fastener dispenser tool of claim 1, wherein the presentation slot and the retention slot are formed on opposing sides of the presentation section.
de_de: 5. Befestigungsmittelspenderwerkzeug nach Anspruch 1, wobei der Präsentationsschlitz und der Halteschlitz auf gegenüberliegenden Seiten des Präsentationsbereichs ausgebildet sind.

source: 6. The fastener dispenser tool of claim 1, wherein the retention slot comprises a head retention portion (150, 250) and a shaft pass-through portion (152, 252), the head retention portion sized to receive and support heads (154, 254) of the plurality of fasteners, and the shaft pass-through portion sized to receive threaded ends (134, 234) of the plurality of fasteners.
de_de: 6. Befestigungsmittelspenderwerkzeug nach Anspruch 1, wobei der Halteschlitz einen Kopfhalteabschnitt (150, 250) und einen Schaftdurchgangsabschnitt (152, 252) umfasst, wobei der Kopfhalteabschnitt bemessen ist, um Köpfe (154, 254) der Vielzahl von Befestigungsmitteln aufzunehmen und zu stützen, und der Schaftdurchgangsabschnitt bemessen ist, um Gewindeenden (134, 234) der Vielzahl von Befestigungsmitteln aufzunehmen.

source: 7. The fastener dispenser tool of claim 1, wherein at least a portion (164, 464) of the presentation section comprises a curved profile; or
de_de: 7. Befestigungsmittelspenderwerkzeug nach Anspruch 1, wobei mindestens ein Abschnitt (164, 464) des Präsentationsbereichs ein gekrümmtes Profil aufweist; oder

source: wherein presentation section comprises a dispensing tip (160, 260, 460) formed such that the retention slot and the presentation slot are exposed proximate the dispensing tip for dispensing of the lead fastener.
de_de: wobei der Präsentationsbereich eine Ausgabespitze (160, 260, 460) umfasst, die derart ausgebildet ist, dass der Halteschlitz und der Präsentationsschlitz in der Nähe der Ausgabespitze zum Ausgeben des Hauptbefestigungsmittels freiliegen.

source: 8. The fastener dispenser tool of claim 1, further comprising a support handle (102) configured to be held by an individual, wherein the retention section and the presentation section define a fastener dispenser magazine (104, 204, 404), wherein the fastener dispenser magazine is removably coupleable to the support handle.
de_de: 8. Befestigungsmittelspenderwerkzeug nach Anspruch 1, das ferner einen Haltegriff (102) umfasst, der konfiguriert ist, um von einer Person gehalten zu werden, wobei der Haltebereich und der Präsentationsbereich ein Befestigungsmittelspendermagazin (104, 204, 404) definieren, wobei das Befestigungsmittelspendermagazin abnehmbar mit dem Haltegriff koppelbar ist.

source: 9. The fastener dispenser tool of claim 8, wherein the support handle comprises a thread protection portion (132) configured to surround threads (134) of the plurality of fasteners when the fastener dispenser magazine is coupled to the support handle; or
de_de: 9. Befestigungsmittelspenderwerkzeug nach Anspruch 8, wobei der Haltegriff einen Gewindeschutzabschnitt (132) umfasst, der konfiguriert ist, um die Gewinde (134) der Vielzahl von Befestigungsmitteln zu umgeben, wenn das Befestigungsmittelspendermagazin mit dem Haltegriff gekoppelt ist; oder

source: wherein the support handle comprises a magazine retention device (136) for removably coupling the fastener dispenser magazine to the support handle.
de_de: wobei der Haltegriff eine Magazinhaltevorrichtung (136) zum abnehmbaren Koppeln des Befestigungsmittelspendermagazin mit dem Haltegriff umfasst.

source: The fastener dispenser tool of claim 1, further comprising a support handle integrally formed with the retention section, such that the fastener dispenser tool is formed from a single, unitary piece of material.
de_de: Befestigungsmittelspenderwerkzeug nach Anspruch 1, das ferner einen Haltegriff umfasst, der derart einstückig mit dem Haltebereich ausgebildet ist, dass das Befestigungsmittelspenderwerkzeug aus einem einzigen, einheitlichen Materialstück ausgebildet ist.

source: A fastener dispensing system, comprising:
de_de: Befestigungsmittel-Ausgabesystem, umfassend:

source: a support handle (102) configured to be held by an individual;
de_de: einen Haltegriff (102), der konfiguriert ist, um von einer Person gehalten zu werden;

source: a fastener dispenser magazine (104, 204, 404) coupled to the support handle, and comprising a retention slot (148, 248, 448) and a presentation slot (112, 212, 412);
de_de: ein Befestigungsmittelspendermagazin (104, 204, 404), das mit dem Haltegriff gekoppelt ist und einen Halteschlitz (148, 248, 448) und einen Präsentationsschlitz (112, 212, 412) umfasst;

source: a plurality of fasteners (106, 206, 406) supported by the retention slot; and
de_de: eine Vielzahl von Befestigungsmitteln (106, 206, 406), die durch den Halteschlitz gestützt werden; und

source: a fastening tool (116) comprising a tool bit (114) engageable through the presentation slot and with a lead fastener (106a, 406a) of the plurality of fasteners;
de_de: ein Befestigungsmittelwerkzeug (116), das ein Werkzeugstück (114) umfasst, das durch den Präsentationsschlitz und mit einem Hauptbefestigungsmittel (106a, 406a) der Vielzahl von Befestigungsmitteln verbindbar ist;

source: wherein the plurality of fasteners are slidable through the retention slot along a presentation section (146, 446) to facilitate dispensing of the lead fastener from the fastener dispenser magazine;
de_de: wobei die Vielzahl von Befestigungmitteln durch den Halteschlitz entlang eines Präsentationsbereichs (146, 446) schiebbar ist, um die Ausgabe des Hauptbefestigungsmittels aus dem Befestigungsmittelspendermagazin zu erleichtern;

source: wherein the fastener dispenser magazine comprises a retention section (144, 444) and the presentation section that extends from the retention section, the presentation section and the retention section comprising the presentation slot formed on an opposing side from the retention slot; and
de_de: wobei das Befestigungsmittelspendermagazin einen Haltebereich (144, 444) und den Präsentationsbereich umfasst, der sich von dem Haltebereich aus erstreckt, wobei der Präsentationsbereich und der Haltebereich den Präsentationsschlitz umfassen, der auf einer dem Halteschlitz gegenüberliegenden Seite ausgebildet ist; und

source: wherein the presentation section comprises a curved profile section (164, 464) that extends from the retention section, such that the lead fastener is moveable to a dispensing position proximate a tip of the fastener dispenser magazine for engagement with a structure, whereby the curved profile section facilitates clearance of remaining fasteners in the fastener dispenser magazine away from the structure.
de_de: wobei der Präsentationsbereich einen gekrümmten Profilbereich (164, 464) umfasst, der sich von dem Haltebereich aus derart erstreckt, dass das Hauptbefestigungsmittel in eine Ausgabeposition in der Nähe einer Spitze des Befestigungsmittelspendermagazins zum Verbinden mit einer Struktur bewegbar ist, wobei der gekrümmte Profilabschnitt das Entfernen im Befestigungsmittelspendermagazin verbleibender Befestigungsmittel von der Struktur erleichtert.
